pine64/bl602-re/blobs/bl602_demo_at.reko/bl602_demo_at_rodata_0002.c
// bl602_demo_at_rodata_0002.c
// Generated by decompiling bl602_demo_at.elf
// using Reko decompiler version 0.9.3.0.

#include "bl602_demo_at.h"

int32 g_dw230C9A58 = 0x0000C02C;
struct Eq_274 g_t230C9DD0 = 
	{
		99,
		
		{
			110
		},
		
		{
			114
		},
		
		{
			0x0069
		},
		0x626D,
		
		{
			115
		},
	};
struct Eq_274 g_t230C9DE4 = 
	{
		0x3D,
		
		{
			114
		},
		
		{
			99
		},
		
		{
			0x0069
		},
		0x6665,
		
		{
			32
		},
	};
struct Eq_274 g_t230C9DFC = 
	{
		110,
		
		{
			78
		},
		
		{
			110
		},
		
		{
			101
		},
		0x202C,
		
		{
			115
		},
	};
struct Eq_274 g_t230C9E0C = 
	{
		99,
		
		{
			0x0069
		},
		
		{
			114
		},
		
		{
			110
		},
		0x6425,
		
		{
			114
		},
	};
struct Eq_274 g_t230C9E64 = 
	{
		99,
		
		{
			110
		},
		
		{
			101
		},
		
		{
			44
		},
		29555,
		
		{
			101
		},
	};
struct Eq_274 g_t230C9EA4 = 
	{
		99,
		
		{
			110
		},
		
		{
			111
		},
		
		{
			0
		},
		27747,
		
		{
			101
		},
	};
struct Eq_274 g_t230C9EE4 = 
	{
		110,
		
		{
			101
		},
		
		{
			32
		},
		
		{
			0x0068
		},
		26997,
		
		{
			115
		},
	};
struct Eq_274 g_t230C9F3C = 
	{
		99,
		
		{
			110
		},
		
		{
			101
		},
		
		{
			44
		},
		0x6964,
		
		{
			37
		},
	};
struct Eq_274 g_t230C9F60 = 
	{
		99,
		
		{
			110
		},
		
		{
			37
		},
		
		{
			98
		},
		29285,
		
		{
			101
		},
	};
struct Eq_274 g_t230C9F80 = 
	{
		99,
		
		{
			110
		},
		
		{
			101
		},
		
		{
			44
		},
		0x6964,
		
		{
			115
		},
	};
struct Eq_274 g_t230C9FA0 = 
	{
		99,
		
		{
			110
		},
		
		{
			115
		},
		
		{
			116
		},
		0x6F69,
		
		{
			115
		},
	};
struct Eq_274 g_t230C9FD0 = 
	{
		0x62,
		
		{
			101
		},
		
		{
			110
		},
		
		{
			32
		},
		0x6E65,
		
		{
			101
		},
	};
struct Eq_274 g_t230C9FE4 = 
	{
		99,
		
		{
			110
		},
		
		{
			110
		},
		
		{
			101
		},
		0x202C,
		
		{
			110
		},
	};
struct Eq_274 g_t230CA018 = 
	{
		99,
		
		{
			110
		},
		
		{
			32
		},
		
		{
			115
		},
		0x7420,
		
		{
			122
		},
	};
struct Eq_274 g_t230CA04C = 
	{
		99,
		
		{
			110
		},
		
		{
			0x0066
		},
		
		{
			110
		},
		0x2520,
		
		{
			101
		},
	};
struct Eq_274 g_t230CA070 = 
	{
		99,
		
		{
			110
		},
		
		{
			110
		},
		
		{
			110
		},
		0x676E,
		
		{
			32
		},
	};
struct Eq_274 g_t230CA0A0 = 
	{
		115,
		
		{
			0x0069
		},
		
		{
			97
		},
		
		{
			32
		},
		0x6576,
		
		{
			110
		},
	};
struct Eq_274 g_t230CA0C4 = 
	{
		99,
		
		{
			110
		},
		
		{
			32
		},
		
		{
			115
		},
		0x00,
		
		{
			101
		},
	};
struct Eq_274 g_t230CA0F0 = 
	{
		0x3C,
		
		{
			114
		},
		
		{
			60
		},
		
		{
			97
		},
		0x7320,
		
		{
			97
		},
	};
struct Eq_274 g_t230CA3FC = 
	{
		0x66,
		
		{
			100
		},
		
		{
			100
		},
		
		{
			115
		},
		24430,
		
		{
			0x0069
		},
	};
struct Eq_274 g_t230CA41C = 
	{
		110,
		
		{
			122
		},
		
		{
			100
		},
		
		{
			112
		},
		0x7478,
		
		{
			0x0068
		},
	};
struct Eq_274 g_t230CA484 = 
	{
		0x66,
		
		{
			100
		},
		
		{
			0
		},
		
		{
			61
		},
		29281,
		
		{
			101
		},
	};
struct Eq_274 g_t230CA49C = 
	{
		117,
		
		{
			111
		},
		
		{
			101
		},
		
		{
			97
		},
		0x00,
		
		{
			0
		},
	};
struct Eq_274 g_t230CA4C4 = 
	{
		0x6C,
		
		{
			99
		},
		
		{
			0x0068
		},
		
		{
			101
		},
		0x6162,
		
		{
			-76
		},
	};
struct Eq_274 g_t230CA818 = 
	{
		116,
		
		{
			101
		},
		
		{
			0x0068
		},
		
		{
			115
		},
		14949,
		
		{
			111
		},
	};
struct Eq_274 g_t230CA894 = 
	{
		0x69,
		
		{
			0x006C
		},
		
		{
			-116
		},
		
		{
			-78
		},
		0x6573,
		
		{
			0x0069
		},
	};
Eq_2 g_a230CA8BC[] = 
	{
	};
struct Eq_274 g_t230CA908 = 
	{
		115,
		
		{
			101
		},
		
		{
			101
		},
		
		{
			32
		},
		24947,
		
		{
			116
		},
	};
struct Eq_274 g_t230CA91C = 
	{
		0x3D,
		
		{
			97
		},
		
		{
			110
		},
		
		{
			101
		},
		0x7620,
		
		{
			97
		},
	};
struct Eq_274 g_t230CA944 = 
	{
		99,
		
		{
			110
		},
		
		{
			101
		},
		
		{
			32
		},
		0x7020,
		
		{
			101
		},
	};
struct Eq_274 g_t230CA968 = 
	{
		0x62,
		
		{
			99
		},
		
		{
			114
		},
		
		{
			114
		},
		0x6E6F,
		
		{
			0x006D
		},
	};
struct Eq_274 g_t230CA984 = 
	{
		99,
		
		{
			110
		},
		
		{
			32
		},
		
		{
			32
		},
		0x7364,
		
		{
			97
		},
	};
struct Eq_274 g_t230CA9A8 = 
	{
		99,
		
		{
			110
		},
		
		{
			32
		},
		
		{
			32
		},
		0x7364,
		
		{
			0x0078
		},
	};
struct Eq_274 g_t230CA9E4 = 
	{
		99,
		
		{
			110
		},
		
		{
			116
		},
		
		{
			99
		},
		0x746E,
		
		{
			50
		},
	};
struct Eq_274 g_t230CAA08 = 
	{
		99,
		
		{
			110
		},
		
		{
			110
		},
		
		{
			115
		},
		29295,
		
		{
			0x0069
		},
	};
struct Eq_274 g_t230CAA2C = 
	{
		0x43,
		
		{
			110
		},
		
		{
			0x006D
		},
		
		{
			100
		},
		8285,
		
		{
			58
		},
	};
struct Eq_274 g_t230CAA6C = 
	{
		99,
		
		{
			110
		},
		
		{
			112
		},
		
		{
			115
		},
		0x6C65,
		
		{
			101
		},
	};
struct Eq_274 g_t230CAAAC = 
	{
		99,
		
		{
			0x0069
		},
		
		{
			111
		},
		
		{
			0x0066
		},
		8292,
		
		{
			0x0069
		},
	};
struct Eq_274 g_t230CAB1C = 
	{
		0x66,
		
		{
			100
		},
		
		{
			0
		},
		
		{
			99
		},
		0x746E,
		
		{
			101
		},
	};
struct Eq_274 g_t230CAB38 = 
	{
		0x70,
		
		{
			101
		},
		
		{
			114
		},
		
		{
			0x006C
		},
		0x7469,
		
		{
			0
		},
	};
struct Eq_274 g_t230CAB64 = 
	{
		0x66,
		
		{
			100
		},
		
		{
			0x0068
		},
		
		{
			110
		},
		0x6D6D,
		
		{
			101
		},
	};
struct Eq_274 g_t230CAB8C = 
	{
		99,
		
		{
			110
		},
		
		{
			0x0068
		},
		
		{
			116
		},
		0x6F69,
		
		{
			0
		},
	};
struct Eq_274 g_t230CABBC = 
	{
		110,
		
		{
			0x0069
		},
		
		{
			101
		},
		
		{
			115
		},
		8308,
		
		{
			115
		},
	};
struct Eq_274 g_t230CABE0 = 
	{
		0x66,
		
		{
			100
		},
		
		{
			100
		},
		
		{
			0x006D
		},
		27764,
		
		{
			101
		},
	};
struct Eq_274 g_t230CAC04 = 
	{
		0x66,
		
		{
			100
		},
		
		{
			0x0069
		},
		
		{
			115
		},
		0x7365,
		
		{
			110
		},
	};
struct Eq_274 g_t230CAC24 = 
	{
		116,
		
		{
			101
		},
		
		{
			0x0069
		},
		
		{
			116
		},
		0x6572,
		
		{
			111
		},
	};
struct Eq_274 g_t230CAC3C = 
	{
		116,
		
		{
			101
		},
		
		{
			84
		},
		
		{
			69
		},
		0x544F,
		
		{
			101
		},
	};
struct Eq_274 g_t230CAC6C = 
	{
		115,
		
		{
			0x0069
		},
		
		{
			99
		},
		
		{
			101
		},
		0x7469,
		
		{
			60
		},
	};
struct Eq_274 g_t230CAC98 = 
	{
		114,
		
		{
			0x0069
		},
		
		{
			114
		},
		
		{
			0x0069
		},
		0x6320,
		
		{
			116
		},
	};
struct Eq_274 g_t230CACC0 = 
	{
		116,
		
		{
			110
		},
		
		{
			114
		},
		
		{
			0x0069
		},
		101,
		
		{
			0x0069
		},
	};
struct Eq_274 g_t230CACD8 = 
	{
		99,
		
		{
			101
		},
		
		{
			114
		},
		
		{
			0x0069
		},
		0x2065,
		
		{
			32
		},
	};
struct Eq_274 g_t230CACF8 = 
	{
		99,
		
		{
			101
		},
		
		{
			99
		},
		
		{
			0x0069
		},
		29793,
		
		{
			100
		},
	};
struct Eq_274 g_t230CAD1C = 
	{
		115,
		
		{
			101
		},
		
		{
			0x0069
		},
		
		{
			97
		},
		0x696D,
		
		{
			0
		},
	};
struct Eq_274 g_t230CAD64 = 
	{
		99,
		
		{
			0x0069
		},
		
		{
			101
		},
		
		{
			100
		},
		0x6168,
		
		{
			101
		},
	};
struct Eq_274 g_t230CAD84 = 
	{
		99,
		
		{
			0x0069
		},
		
		{
			0x0069
		},
		
		{
			0
		},
		0x6573,
		
		{
			101
		},
	};
struct Eq_274 g_t230CADBC = 
	{
		99,
		
		{
			0x0069
		},
		
		{
			32
		},
		
		{
			0x0068
		},
		26997,
		
		{
			114
		},
	};
struct Eq_274 g_t230CAE20 = 
	{
		115,
		
		{
			99
		},
		
		{
			110
		},
		
		{
			32
		},
		0x6874,
		
		{
			101
		},
	};
struct Eq_274 g_t230CAE3C = 
	{
		99,
		
		{
			101
		},
		
		{
			0x0069
		},
		
		{
			114
		},
		25972,
		
		{
			99
		},
	};
struct Eq_274 g_t230CAE6C = 
	{
		0x67,
		
		{
			99
		},
		
		{
			61
		},
		
		{
			114
		},
		0x7320,
		
		{
			32
		},
	};
struct Eq_274 g_t230CAEA0 = 
	{
		0x67,
		
		{
			110
		},
		
		{
			58
		},
		
		{
			100
		},
		0x5D,
		
		{
			110
		},
	};
struct Eq_274 g_t230CAEC0 = 
	{
		0x3C,
		
		{
			97
		},
		
		{
			32
		},
		
		{
			116
		},
		8292,
		
		{
			101
		},
	};
struct Eq_274 g_t230CB340 = 
	{
		0x20,
		
		{
			37
		},
		
		{
			3
		},
		
		{
			7
		},
		0x0C0B,
		
		{
			-16
		},
	};
struct Eq_274 g_t230CB34C = 
	{
		0x25,
		
		{
			101
		},
		
		{
			0x0F
		},
		
		{
			19
		},
		0x1817,
		
		{
			-16
		},
	};
struct Eq_274 g_t230CB360 = 
	{
		0x2E,
		
		{
			0
		},
		
		{
			29
		},
		
		{
			33
		},
		0x2625,
		
		{
			-16
		},
	};
int32 g_a230CB3F8[] = 
	{
	};
int32 g_a230CB434[] = 
	{
	};
Eq_567044 g_t230CB470 = 
	{
		
		{
		},
	};
int32 g_a230CB6B4[] = 
	{
	};
byte g_a230CB88C[] = 
	{
	};
byte g_b230CB898 = 0x00;
byte g_b230CB899 = 0x0F;
byte g_b230CB89A = 0xAC;
Eq_65767 g_t230CB940 = 
	{
		
		{
		},
		~0x00,
	};
byte g_a230CB968[9] = 
	{
		0x00,
		0x60,
		0x04,
		0x00,
		~0x07,
		0x07,
		0x40,
		0x02,
		0x00,
	};
byte g_b230CB970 = 0x00;
byte g_b230CB971 = 0x03;
byte g_b230CB972 = 0x01;
byte g_b230CB973 = 0x02;
byte g_b230CB974 = 0x03;
Eq_157109 g_t230CB990 = 
	{
		~0x00,
		~0x00,
	};
word32 g_dw230CBAA4 = 587580020;
struct Eq_337416 g_t230CBAAC = 
	{
		
		{
			0
		},
		
		{
			0
		},
	};
struct Eq_336737 * g_ptr230CBAB0 = &g_tFCF8F0;
struct Eq_365787 * g_a230CBAC8[] = 
	{
	};
byte g_a230CBAD8[5] = 
	{
		0x01,
		0x03,
		0x1C,
		0x06,
		0x00,
	};
union Eq_109206 * g_ptr230CBADC = null;
int32 g_dw230CBAE0 = -1;
Eq_2 g_a230CBB00[] = 
	{
	};
Eq_2 g_t230CBB30 = 
	{
		30
	};
Eq_2 g_t230CBB38 = 
	{
		44
	};
Eq_2 g_t230CBB40 = 
	{
		56
	};
Eq_2 g_t230CBB48 = 
	{
		0
	};
Eq_342969 g_t230CBF90 = 
	{
		
		{
			-72
		},
		help_cmd,
	};
<anonymous> * g_ptr230CC000 = &g_t230BFE84;
